simulations/icofoam_cases/2_wall_6_ceiling/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    wall
    {
        type            patch;
        physicalType    patch;
        nFaces          16758;
        startFace       263301;
    }
    surface
    {
        type            patch;
        physicalType    patch;
        nFaces          3600;
        startFace       280059;
    }
    main_outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          24;
        startFace       283659;
    }
    branch_inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          72;
        startFace       283683;
    }
    branch_outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          72;
        startFace       283755;
    }
    main_inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          24;
        startFace       283827;
    }
)

// ************************************************************************* //
